# Importing **Libraries**

In [1]:
import pandas as pd

# Reading **File**

In [2]:
people={'First':['Shruti','Rutuja','Dhaval'],
        'Last':['Jawale','Shinde','Joshi'],
        'Email':['shrutijawale111@gmail.com','rutuja123@gmail.com','dj@gmail.com']
       }
df=pd.DataFrame(people)
df

    First    Last                      Email
0  Shruti  Jawale  shrutijawale111@gmail.com
1  Rutuja  Shinde        rutuja123@gmail.com
2  Dhaval   Joshi               dj@gmail.com

# To access **Columns**

In [3]:
df['Email']

0    shrutijawale111@gmail.com
1          rutuja123@gmail.com
2                 dj@gmail.com
Name: Email, dtype: object

# Access multiple **Columns**

In [4]:
df[['Last','Email']]

     Last                      Email
0  Jawale  shrutijawale111@gmail.com
1  Shinde        rutuja123@gmail.com
2   Joshi               dj@gmail.com

# To display **rows**

In [5]:
df.loc[0]

First                       Shruti
Last                        Jawale
Email    shrutijawale111@gmail.com
Name: 0, dtype: object

# Using Filter to filt **data**

In [6]:
filt=(df['Last']=='Jawale')
df[filt]

    First    Last                      Email
0  Shruti  Jawale  shrutijawale111@gmail.com

# Updating ***Rows*** and ***Columns***

In [7]:
df.columns

Index(['First', 'Last', 'Email'], dtype='object')

In [8]:
df.columns=['First-name','Last-name','Email']
df.columns

Index(['First-name', 'Last-name', 'Email'], dtype='object')

In [9]:
df.columns=[x.upper() for x in df.columns]
df

  FIRST-NAME LAST-NAME                      EMAIL
0     Shruti    Jawale  shrutijawale111@gmail.com
1     Rutuja    Shinde        rutuja123@gmail.com
2     Dhaval     Joshi               dj@gmail.com

# ***Apply*** Method

In [10]:
df['EMAIL'].apply(len) #gives length of that col

0    25
1    19
2    12
Name: EMAIL, dtype: int64

# ***Applymap*** Method

In [11]:
df.applymap(len)   #Gives length of all charecters

   FIRST-NAME  LAST-NAME  EMAIL
0           6          6     25
1           6          6     19
2           6          5     12

# ***Map*** Method

In [12]:
df['FIRST-NAME'].map({'Shruti':'Shrutz','Rutuja':'Rutu'}) #to cahnge names

0    Shrutz
1      Rutu
2       NaN
Name: FIRST-NAME, dtype: object

# To Add **Columns**

In [13]:
df['Full-Name']=df['FIRST-NAME']+' '+df['LAST-NAME']
df

  FIRST-NAME LAST-NAME                      EMAIL      Full-Name
0     Shruti    Jawale  shrutijawale111@gmail.com  Shruti Jawale
1     Rutuja    Shinde        rutuja123@gmail.com  Rutuja Shinde
2     Dhaval     Joshi               dj@gmail.com   Dhaval Joshi

# To Delete **Column**

In [14]:
df.drop(columns=['FIRST-NAME','LAST-NAME'])

                       EMAIL      Full-Name
0  shrutijawale111@gmail.com  Shruti Jawale
1        rutuja123@gmail.com  Rutuja Shinde
2               dj@gmail.com   Dhaval Joshi

# Sorting **Data**

In [15]:
df.sort_values(by='FIRST-NAME')

  FIRST-NAME LAST-NAME                      EMAIL      Full-Name
2     Dhaval     Joshi               dj@gmail.com   Dhaval Joshi
1     Rutuja    Shinde        rutuja123@gmail.com  Rutuja Shinde
0     Shruti    Jawale  shrutijawale111@gmail.com  Shruti Jawale